       IDENTIFICATION DIVISION.
       PROGRAM-ID. INSECURE.
      * COMMENTED SECRET SHOULD BE IGNORED
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-PASSWORD PIC X(16) VALUE "supersecret".
       01 WS-ALGO     PIC X(04) VALUE "MD5".
       PROCEDURE DIVISION.
           EXEC CICS LINK PROGRAM('PAYAPI') COMMAREA(WS-COMMAREA) END-EXEC.
           CALL 'SYSTEM'.
           GOBACK.
